<?php
//<p>27. Выполните скрипт по задаче №4 из консоли
// (необходимо запустить php скрипт по задаче №4 из командной строки).
// (Текст задания: Выведите фразу "Мне %ваш_возраст% лет", например: "Мне 20 лет")
//</p>

echo "Код в консоль
1) Переходим в папку с нашим скриптом : cd C:\\xampp\\htdocs\functions_forms_tasks\\php_beginer_level\\Task27_2\\
2) Прописываем путь к файлу php.exe и через пробел говорим какой файл выполнить
    В мем случае это было так: C:\\Users\\User\\Desktop\\Programs\\WEB\\php\\php.exe Task27.php"

?>