<?php
/**
 * Created by PhpStorm.
 * User: User
 * Date: 22.02.2017
 * Time: 23:43
 */


//<p>19. Составьте массив дней недели. С помощью цикла foreach выведите все дни недели, а
//текущий день выведите курсивом. Текущий день должен храниться в переменной $day.</p>//

$arr = array(1 => "Понедельник", 2 => "Вторник", 3 => "Среда", 4 => "Четверг", 5 => "Пятница", 6 => "Суббота", 7 => "Воскресение");

$day;

foreach ($arr as $val => $elem) {

    if ($val == date("w")) {
        $day = $elem;
        echo "<u>" . "<i>" . $day . "</i>" . "</u>";
        echo "<pre>";
    } else {
        echo $elem;
        echo "<pre>";
    }
}
?>

