<?php
/**
 * Created by PhpStorm.
 * User: User
 * Date: 22.02.2017
 * Time: 23:43
 */


//<p>17.Сосктавьте массив месяцев. С помощью цикла foreach выведите все месяцы, а текущий
//месяц выведите жирным. Текущий месяц должен храниться в переменной $month.</p>


$arr = array(1 => "Январь", 2 => "Февраль", 3 => "Март", 4 => "Апрель", 5 => "Май", 6 => "Июнь", 7 => "Июль", 8 => "Август", 9 => "Сентябрь", 10 => "Октябрь", 11 => "Ноябрь", 12 => "Декабрь");
$month;

foreach ($arr as $val => $elem) {

    if ($val == date("n")) {
        $mont = $elem;
        echo "<u>" . "<b>" . $mont . "</b>" . "</u>";
        echo "<pre>";
    } else {
        echo $elem;
        echo "<pre>";
    }
}
?>

